app/views/sensor_actuator_infos/_form.html.erb

SELECT `sensors`.* FROM `sensors`
---
    <div class="col-lg-10">
      <%= select_tag :sensor_id, options_from_collection_for_select(Sensor.all, :id, :name), { class: "form-control selectpicker", "data-live-search" => "true"  } %>