app/views/green_kub_boxes/_form.html.erb

SELECT `models`.* FROM `models`
---
        <!--<%= f.text_field :model_id, :class => 'form-control' %>-->
        <!--<%= f.select_tag "model_id", options_from_collection_for_select(Model.all, :id, :name), { class: "form-control selectpicker", "data-live-search" => "true"  } %>-->

SELECT `users`.* FROM `users`
---
            <!--<%= f.text_field :user_id, :class => 'form-control' %>
            <%= select_tag "user_id", options_from_collection_for_select(User.all, :id, :email), { class: "form-control selectpicker", "data-live-search" => "true"  } %>