app/views/actuators/_form.html.erb

      <!--<%= f.text_field :actuator_type_id, :class => 'form-control' %>-->
      <!--<%= select_tag :actuator_type_id, options_from_collection_for_select(ActuatorType.all, :id, :name), { class: "form-control selectpicker", "data-live-search" => "true"  } %>-->
---
SELECT `actuator_types`.* FROM `actuator_types`


      <!--<%= select_tag :green_kub_box_id, options_from_collection_for_select(GreenKubBox.all, :model_id, :id), { class: "form-control selectpicker", "data-live-search" => "true"  } %>-->
---
SELECT `green_kub_boxes`.* FROM `green_kub_boxes`