app/views/sensors/_form.html.erb

    <div class="col-lg-5">
      <!--<%= select_tag :sensor_type_id, options_from_collection_for_select(SensorType.all, :name, :id), { class: "form-control selectpicker", "data-live-search" => "true"  } %> -->
---
SELECT `sensor_types`.* FROM `sensor_types`

    <div class="col-lg-5">
    <!--  <%= select_tag :green_kub_box_id, options_from_collection_for_select(GreenKubBox.all, :id, :Serial_Number), { class: "form-control selectpicker", "data-live-search" => "true"  } %>-->
---
SELECT `green_kub_boxes`.* FROM `green_kub_boxes`