app/controllers/actuator_types_controller.rb

SELECT `actuator_types`.* FROM `actuator_types`
---
  def index
    @actuator_types = ActuatorType.all

INSERT INTO `actuator_types` (`name`, `caracteristics`, `created_at`, `updated_at`) VALUES ('asdasdasdas', 'asdasd', '2015-11-20 19:19:05', '2015-11-20 19:19:05')
---
  def create
    @actuator_type = ActuatorType.new(actuator_type_params)

    respond_to do |format|
      if @actuator_type.save

DELETE FROM `actuator_types` WHERE `actuator_types`.`id` = 980190962
---
  def destroy
    @actuator_type.destroy

SELECT  `actuator_types`.* FROM `actuator_types` WHERE `actuator_types`.`actuator_type_id` = '--- !ruby/object:ActiveRecord::StatementCache::Substitute {}\n' LIMIT 1
---
    def set_actuator_type
      @actuator_type = ActuatorType.find(params[:id])