app/controllers/actuators_controller.rb

  def index
    if(current_user.isAdmin)
      @actuators = Actuator.all
---
SELECT `actuators`.* FROM `actuators`

  def create
    @actuator = Actuator.new(actuator_params)

    respond_to do |format|
      if @actuator.save
---
INSERT INTO `actuators` (`ref`, `state`, `actuator_type_id`, `green_kub_box_id`, `created_at`, `updated_at`) VALUES ('Referencia', 1, 1, 1, '2015-12-15 20:17:55', '2015-12-15 20:17:55')

  def destroy
    @actuator.destroy
---
DELETE FROM `actuators` WHERE `actuators`.`id` = 980190962

    def set_actuator
      @actuator = Actuator.find(params[:id])
---
SELECT  `actuators`.* FROM `actuators` WHERE `actuators`.`id` = 980190962 LIMIT 1