app/controllers/green_kub_boxes_controller.rb

  def index
    #faz o display de todos os utilizadores para o user em sessão
    if(session[:isAdmin])
      @green_kub_boxes = GreenKubBox.all
    else
      @green_kub_boxes = GreenKubBox.where(:user_id => session[:user_id])
---
SELECT `green_kub_boxes`.* FROM `green_kub_boxes`
SELECT `green_kub_boxes`.* FROM `green_kub_boxes` WHERE `green_kub_boxes`.`user_id` IS NULL

  def create
    @green_kub_box = GreenKubBox.new(green_kub_box_params)

    respond_to do |format|
      if @green_kub_box.save
---
INSERT INTO `green_kub_boxes` (`user_id`, `model_id`, `Serial_Number`, `created_at`, `updated_at`) VALUES (1, 1, 'NunoPaugrande', '2015-12-15 19:51:21', '2015-12-15 19:51:21')

  def destroy
    @green_kub_box.destroy
---
DELETE FROM `green_kub_boxes` WHERE `green_kub_boxes`.`id` = 980190962

    def set_green_kub_box
      @green_kub_box = GreenKubBox.find(params[:id])
---
SELECT  `green_kub_boxes`.* FROM `green_kub_boxes` WHERE `green_kub_boxes`.`green_kub_box_id` = '--- !ruby/object:ActiveRecord::StatementCache::Substitute {}\n' LIMIT 1