app/controllers/models_controller.rb

  def index
    @models = Model.all
---
SELECT `models`.* FROM `models`

  def create
    @model = Model.new(model_params)

    respond_to do |format|
      if @model.save
---
INSERT INTO `models` (`name`, `caracteristics`, `created_at`, `updated_at`) VALUES ('model1', 'carct', '2015-11-20 19:22:36', '2015-11-20 19:22:36')

  def destroy
    @model.destroy
---
DELETE FROM `models` WHERE `models`.`id` = 980190962

    def set_model
      @model = Model.find(params[:id])
---
SELECT  `models`.* FROM `models` WHERE `models`.`id` = 980190962 LIMIT 1