app/controllers/sensor_types_controller.rb

SELECT `sensor_types`.* FROM `sensor_types`
---
  def index
    @sensor_types = SensorType.all

INSERT INTO `sensor_types` (`name`, `caracteristics`, `unit`, `created_at`, `updated_at`) VALUES ('Teste', 'Ok', '12', '2015-12-22 20:43:25', '2015-12-22 20:43:25')
---
  def create
    @sensor_type = SensorType.new(sensor_type_params)

    respond_to do |format|
      if @sensor_type.save

DELETE FROM `sensor_types` WHERE `sensor_types`.`id` = 980190962
---
  def destroy
    @sensor_type.destroy

SELECT  `sensor_types`.* FROM `sensor_types` WHERE `sensor_types`.`id` = 980190962 LIMIT 1
---
    def set_sensor_type
      @sensor_type = SensorType.find(params[:id])