app/controllers/sensors_controller.rb

  def index
    if(session[:isAdmin])
      @sensors = Sensor.all
---
SELECT `sensors`.* FROM `sensors`

  def create
    logger.debug("hello world!")
    @sensor = Sensor.new(sensor_params)

    respond_to do |format|
      if @sensor.save
---
INSERT INTO `sensors` (`ref`, `state`, `sensor_type_id`, `green_kub_box_id`, `created_at`, `updated_at`) VALUES ('1234', 0, 0, 122345, '2016-01-15 20:55:35', '2016-01-15 20:55:35')

  def update
    respond_to do |format|
      if @sensor.update(sensor_params)
---
UPDATE `sensors` SET `ref` = '12334523', `updated_at` = '2016-03-01 20:31:54' WHERE `sensors`.`id` = 18

  def destroy
    @sensor.destroy
---
DELETE FROM `sensors` WHERE `sensors`.`id` = 980190962

    def set_sensor
      @sensor = Sensor.find(params[:id])
---
SELECT  `sensors`.* FROM `sensors` WHERE `sensors`.`id` = 980190962 LIMIT 1