app/controllers/sensor_actuator_infos_controller.rb

SELECT `sensor_actuator_infos`.* FROM `sensor_actuator_infos`
---
  def index
    if(session[:isAdmin])
      @sensor_actuator_infos = SensorActuatorInfo.all

INSERT INTO `sensor_actuator_infos` (`sensor_id`, `value`, `date`, `created_at`, `updated_at`) VALUES (1, 1, '2015-11-12', '2015-12-11 23:03:31', '2015-12-11 23:03:31')
---
  def create
    @sensor_actuator_info = SensorActuatorInfo.new(sensor_actuator_info_params)

    respond_to do |format|
      if @sensor_actuator_info.save

DELETE FROM `sensor_actuator_infos` WHERE `sensor_actuator_infos`.`id` = 980190962
---
  def destroy
    @sensor_actuator_info.destroy

SELECT  `sensor_actuator_infos`.* FROM `sensor_actuator_infos` WHERE `sensor_actuator_infos`.`id` = 980190962 LIMIT 1
---
    def set_sensor_actuator_info
      @sensor_actuator_info = SensorActuatorInfo.find(params[:id])