app/controllers/sessions_controller.rb

  def create
    user = User.from_omniauth(env["omniauth.auth"])
    session[:email] = user.email
    dbUser = User.find_by_email(user.email)
    if dbUser.present? then
      #se o user existir guarda o id dele
      session[:user_id] = dbUser.id
      session[:isAdmin] = dbUser.isAdmin
    else
      newUser = User.new(:email => user.email,
                       :password => 'noPassword',
                       :password_confirmation => 'noPassword',
                       :provider => user.provider,
                       :uid => user.uid,
                       :name => user.name)
      newUser.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'nuno.rodrigues83@hotmail.com' LIMIT 1
SELECT  1 AS one FROM `users` WHERE `users`.`email` = BINARY 'nuno.rodrigues83@hotmail.com' LIMIT 1
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('nuno.rodrigues83@hotmail.com', '$2a$10$hKQu9hjQLtA5K6PHjNJxK.gg.UW4xjQI7FGcTeRyglJ49GZ7h9.Se', '2016-02-09 19:40:59', '2016-02-09 19:40:59')